![Imgur](https://i.imgur.com/5pXzCIu.png)

# Data Science va Sun'iy Intellekt Praktikum

## Ma'lumotlar tahlili. Pandas kutubxonasi.

### 2.2.3 Foydali funksiyalar (davomi)

### Arifmetik amallar

Ikki `Series` yoki `DataFrame` obyektlari o'rtasida arifmetik amallar bajarishda indekslar juda muhim rol o'ynaydi.

Amallar mos tushuvchi indekslar o'rtasida bajariladi. Agar obyektlarning birida mavjud indeks ikkinchisda yo'q bo'lsa natija `NaN` bo'ladi.

In [17]:
import pandas as pd
import numpy as np

In [18]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [19]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [20]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [21]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

E'tibor bering, `s1` da mavjud `d` indeksi `s2`da mavjud bo'lmaganligi sabab `s1+s2` da `d` indeksdagi qiymat `NaN` bo'ldi.

Yuqoridagi holat `DataFrame`larga ham xos. `Series`lardan farqli ravishda `DataFrame`da qator va ustun indekslari hisobga olinadi.

In [ ]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns=list('bcd'), index=['Olma','Anor','Uzum'])
df2 = pd.DataFrame(np.arange(12.).reshape(4,3), columns=list('abc'), index=['Olma','Anor','Qovun','Anjir'])

In [ ]:
df1

        b    c    d
Olma  0.0  1.0  2.0
Anor  3.0  4.0  5.0
Uzum  6.0  7.0  8.0

In [ ]:
df2

         a     b     c
Olma   0.0   1.0   2.0
Anor   3.0   4.0   5.0
Qovun  6.0   7.0   8.0
Anjir  9.0  10.0  11.0

In [ ]:
df1+df2

        a    b    c   d
Anjir NaN  NaN  NaN NaN
Anor  NaN  7.0  9.0 NaN
Olma  NaN  1.0  3.0 NaN
Qovun NaN  NaN  NaN NaN
Uzum  NaN  NaN  NaN NaN

`a` va `d` ustunlar hamda `Qovun` va `Anjir` qatorlar ikkala `DataFrame`da bo'lmagani sababli yuqoridagi natija chiqdi

Yuqoridagi qo'shish amalini `.add()` metodi yordamida ham bajarish mumkin.

In [ ]:
df1.add(df2)

        a    b    c   d
Anjir NaN  NaN  NaN NaN
Anor  NaN  7.0  9.0 NaN
Olma  NaN  1.0  3.0 NaN
Qovun NaN  NaN  NaN NaN
Uzum  NaN  NaN  NaN NaN

Bunda maxsus `fill_value` parametri yordamida mos tushuvchi indekslardagi NaN qiymatlarni boshqa qiymat bilan almashtirish mumkin. Bu usulda yakuniy natijada ikkala df da ham mavjud bo'lmagan indekslarda `NaN` qimtai qoladi.

In [ ]:
df2.add(df1, fill_value=0)

         a     b     c    d
Anjir  9.0  10.0  11.0  NaN
Anor   3.0   7.0   9.0  5.0
Olma   0.0   1.0   3.0  2.0
Qovun  6.0   7.0   8.0  NaN
Uzum   NaN   6.0   7.0  8.0

In [ ]:
df1

        b    c    d
Olma  0.0  1.0  2.0
Anor  3.0  4.0  5.0
Uzum  6.0  7.0  8.0

In [ ]:
df2

         a     b     c
Olma   0.0   1.0   2.0
Anor   3.0   4.0   5.0
Qovun  6.0   7.0   8.0
Anjir  9.0  10.0  11.0

### Boshqa arifmetik amallar

- add, radd - Qo'shish (+)
- sub, rsub - Ayirish (-)
- div, rdiv - Bo'lish (/)
- floordiv, rfloordiv - Bo'lish va butun qismini olis (//)
- mul, rmul - Ko'paytirish (*)
- pow, rpow - Eksponenta (\*\*)

Yuqoridagi amallarning barchasida `fill_value` parametri mavjud.

`r`bilan boshlangan metodlarda `DataFrame` ifodaning o'ng  tarafida bo'ladi.

In [ ]:
df1

        b    c    d
Olma  0.0  1.0  2.0
Anor  3.0  4.0  5.0
Uzum  6.0  7.0  8.0

In [ ]:
df1.sub(2) # df-2 degani

        b    c    d
Olma -2.0 -1.0  0.0
Anor  1.0  2.0  3.0
Uzum  4.0  5.0  6.0

In [ ]:
df2.rsub(2) # 2-df degani

         a    b    c
Olma   2.0  1.0  0.0
Anor  -1.0 -2.0 -3.0
Qovun -4.0 -5.0 -6.0
Anjir -7.0 -8.0 -9.0